#include <bits/stdc++.h>
using namespace std;
int a, b;
int main()
{
    cin >> a >> b;
    cout << a + b << endl;
    return 0;
}

/*
各位注意!!!!!!!!!!!!!!!! AC后连打Enter画面会的烟花持续时会变短!!!!!!!!!!!
太戈编程的年纪还没我大？！（我9岁）
太戈编程的年纪还没我大？！（我9岁）
太戈编程的年纪还没我大？！（我9岁）
《工作人员将在1~2工作日内审核完》
用int
初学必备
梦想开逝的地方~
第一步，1500难度——达标
我做不出此题，刚想找一块豆腐撞死，就发现return 0；没加，就加了一下，就AC了。。。。。。
*/

/*
各位注意!!!!!!!!!!!!!!!! AC后连打Enter画面会的烟花持续时会变短!!!!!!!!!!!
太戈编程的年纪还没我大？！（我9岁）
太戈编程的年纪还没我大？！（我9岁）
太戈编程的年纪还没我大？！（我9岁）
《工作人员将在1~2工作日内审核完》
用int
初学必备
梦想开逝的地方~
第一步，1500难度——达标
我做不出此题，刚想找一块豆腐撞死，就发现return 0；没加，就加了一下，就AC了。。。。。。
*/
