#include<iostream>
using namespace std;
int main(){
	int i=1; 
	if(i<=10){ //i在记录小明应该跑第几圈。初始化为1 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++; //终于完成一圈了，接下来应该跑第2圈了 
	}
	if(i<=10){ //继续判断：小明接下来应该跑的圈数i，是否还小于等于10？ 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++; //圈数+1：现在应该跑第3圈了 
	}
	if(i<=10){ 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;
	}
	if(i<=10){ 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;
	}
	if(i<=10){
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;  
	}
	if(i<=10){ 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;
	}
	if(i<=10){ 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;
	}
	if(i<=10){ 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;
	}
	if(i<=10){ 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;
	}
	if(i<=10){  //到这里：i为10，表示接下来马上应该跑第10圈了 
		cout<<"小明正在跑第"<<i<<"圈"<<endl;
		i++;
	}
	//想想看，如果再写一个if语句，还会输出吗？		
	return 0;
} 


